# SQL: Solution for SQL test

In this notebook we will discuss about how to solve an SQL Test with excel provided.

In [1]:
# Importing the library
import pandas as pd
import seaborn as sns
from sqlalchemy import create_engine

The data consist of two sheets:
 <ul>
  <li>user_tab: [userid, register_time, country]</li>
  <li>order_tab: [orderid, userid, itemid, gmv, order_time]</li>
</ul>

## 1) Converting the sheets to csv

In [2]:
user_tab = pd.read_excel("../sql_bootcamp/sql_test.xlsx", sheet_name="user_tab")
order_tab = pd.read_excel("../sql_bootcamp/sql_test.xlsx", sheet_name="order_tab")
combine = [user_tab, order_tab]

In [3]:
user_tab.head()

   userid register_time country
0   10310    2017-03-02      TW
1   10313    2017-03-20      SG
2   10323    2017-03-26      TW
3   10330    2017-05-02      VN
4   10333    2017-01-10      TH

In [4]:
order_tab.head()

   orderid  userid   itemid  gmv order_time
0  1030132   64177  3366770   27 2017-04-24
1  1030137   10475  6130641   69 2017-02-02
2  1030147   28286  6770063   87 2017-04-25
3  1030153   28282  4193426   82 2017-05-11
4  1030155   64970  8825994   29 2017-03-07

In [5]:
#converting to csv
user_tab.to_csv("user_tab.csv", index=False)
order_tab.to_csv("order_tab.csv", index=False)

## 2) Importing csv files to database server

### First we create an empty table using pgAdmin, so we can import the csv files later.

```SQL
CREATE TABLE order_tab
    (orderid integer,
    userid integer,
    itemid integer,
    gmv integer,
    order_time date);
	
CREATE TABLE user_tab
	(userid integer,
	 register_time date,
	 country text);
```
<img src="images/create_tables.png" alt="create table" width="850"/> <br>

 ### Then, we import the csv files as shown by the figure below
 Do it for all files.
 <img src="images/import.png" alt="import" width="300"/> <br>
 <img src="images/import_csv.png" alt="import csv" width="500"/>

## 3) Using sqlalchemy to run queries

In [6]:
%load_ext sql

In [7]:
# conecting to posgresql server
%sql postgresql://postgres:12345@localhost/bi_test

'Connected: postgres@bi_test'

In [8]:
# creating the engine
engine = create_engine('postgresql://postgres:12345@localhost/bi_test')

#### Checking the tables

In [9]:
%%sql
SELECT * FROM order_tab 
LIMIT 5;

 * postgresql://postgres:***@localhost/bi_test
5 rows affected.

[(1030132, 64177, 3366770, 27, datetime.date(2017, 4, 24)),
 (1030137, 10475, 6130641, 69, datetime.date(2017, 2, 2)),
 (1030147, 28286, 6770063, 87, datetime.date(2017, 4, 25)),
 (1030153, 28282, 4193426, 82, datetime.date(2017, 5, 11)),
 (1030155, 64970, 8825994, 29, datetime.date(2017, 3, 7))]

In [10]:
%%sql
SELECT * FROM user_tab
LIMIT 5;

 * postgresql://postgres:***@localhost/bi_test
5 rows affected.

[(10310, datetime.date(2017, 3, 2), 'TW'),
 (10313, datetime.date(2017, 3, 20), 'SG'),
 (10323, datetime.date(2017, 3, 26), 'TW'),
 (10330, datetime.date(2017, 5, 2), 'VN'),
 (10333, datetime.date(2017, 1, 10), 'TH')]

## 4) Solving the questions